{
    "RegularEvents": [],
    "LoanEvents": [
        {
            "key": "the minotaur salesman",
            "value": {
                "id": 1,
                "eventDuration": 4,
                "type": 1,
                "name": "The Minotaur salesman",
                "resolutionName": "",
                "text": "“For generations my family has guarded the maze, it’s so old fashioned” said the Minotaur. “I want to see the world, meet new people, and sell them high quality axes! I know what you think, ‘Everyone will be too afraid to even talk to him!’ but don’t worry” he said with a wink “my charisma will win them over”.",
                "resolutionText": "",
                "eventRequirements": [],
                "loanCost": 100,
                "chanceOfSuccess": 90
            }
        },
        {
            "key": "troll toll",
            "value": {
                "id": 2,
                "eventDuration": 2,
                "type": 1,
                "name": "Troll Toll",
                "resolutionName": "",
                "text": "Three trolls enter the chamber. The largest of them says: “We Trolls are starting a security company. No more lone troll guarding one bridge. Now any lord can have Trolls guard his castle. Need gold to advertise new company. Give us gold, we give more back”",
                "resolutionText": "",
                "eventRequirements": [],
                "loanCost": 80,
                "chanceOfSuccess": 85
            }
        },
        {
            "key": "tomato farmer",
            "value": {
                "id": 3,
                "eventDuration": 5,
                "type": 1,
                "name": "Tomato Farmer",
                "resolutionName": "",
                "text": "A tall man with a large hat says \"I tried being a bandit, was no good at it. My father was a tomato farmer, time to go back to my roots\"",
                "resolutionText": "",
                "eventRequirements": [],
                "loanCost": 60,
                "chanceOfSuccess": 82
            }
        },
        {
            "key": "dragon school",
            "value": {
                "id": 5,
                "eventDuration": 6,
                "type": 1,
                "name": "Dragon School",
                "resolutionName": "",
                "text": "A family of silver drakes wants to open a school for mages. They lost their hoard of gold and gems after being raided by a group of adventurers and could use a little help",
                "resolutionText": "",
                "eventRequirements": [
                    4
                ],
                "loanCost": 70,
                "chanceOfSuccess": 70
            }
        },
        {
            "key": "the wise monk",
            "value": {
                "id": 6,
                "eventDuration": 3,
                "type": 1,
                "name": "The Wise Monk",
                "resolutionName": "",
                "text": "An old monk with thick eyebrows approaches: \"I've meditated all my life and have reached enlightenment. My only wish is to share my knowledge with others. 20 others at a time, for an exclusive price\"",
                "resolutionText": "",
                "eventRequirements": [
                    4
                ],
                "loanCost": 25,
                "chanceOfSuccess": 20
            }
        },
        {
            "key": "open stage tavern",
            "value": {
                "id": 7,
                "eventDuration": 4,
                "type": 1,
                "name": "Open Stage Tavern",
                "resolutionName": "",
                "text": "A mediocre looking musician approaches: \"Life is hard for an average bard. Taverns only want the good bards to play for them. I'm going to change that and open a tavern where only average bards can play. Patrons will like that... right?\"",
                "resolutionText": "",
                "eventRequirements": [
                    4
                ],
                "loanCost": 55,
                "chanceOfSuccess": 25
            }
        },
        {
            "key": "garden of the ent",
            "value": {
                "id": 8,
                "eventDuration": 12,
                "type": 1,
                "name": "Garden of the Ent",
                "resolutionName": "",
                "text": "It looks like a large Oak tree was planted in the middle of the hall, but it turns out to be an Ent! How unusual. Slowly, he starts to speak: \"MMmmm.. I.. want to.. plant.. a garden.. of.. trees. MMMm\" a tall Elf steps beside the Ent \"If you'll allow me, master Onod. We propose to start a gardening venture of sorts, specializing in planting new forests. Master Onod will provide his unique expertise and oversight and we elves will provide a... swifter pace of labor than the Ents are comftarble with\". The Ent grunts, seemingly in approval. \"A natural partnership!\".",
                "resolutionText": "",
                "eventRequirements": [],
                "loanCost": 45,
                "chanceOfSuccess": 75
            }
        },
        {
            "key": "the wolf breeder",
            "value": {
                "id": 9,
                "eventDuration": 5,
                "type": 1,
                "name": "The Wolf Breeder",
                "resolutionName": "",
                "text": "I train wolves. For hunters, scouts. Dire wolves for war. I have a few cubs. Not enough. Need to buy land, build training grounds. Lot of customers looking for well trained wolves...",
                "resolutionText": "",
                "eventRequirements": [],
                "loanCost": 90,
                "chanceOfSuccess": 50
            }
        },
        {
            "key": "band of adventurers",
            "value": {
                "id": 4,
                "eventDuration": 4,
                "type": 1,
                "name": "Band of Adventurers",
                "resolutionName": "boa resolution",
                "text": "A group of bright eyed adventurers approaches: \"There's amazing treasure in the ruins atop Supi mountain. We just need a small loan to get enchanted armor and weapons so we can deal with the monsters there!\"",
                "resolutionText": "resolution text",
                "eventRequirements": [],
                "loanCost": 130,
                "chanceOfSuccess": 45
            }
        }
    ]
}